{"class_name": "Model", "config": {"name": "model_14", "layers": [{"name": "input_17", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 69], "dtype": "float32", "sparse": false, "name": "input_17"}, "inbound_nodes": []}, {"name": "lstm_9", "class_name": "LSTM", "config": {"name": "lstm_9", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "units": 256, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "inbound_nodes": [[["input_17", 0, 0, {}]]]}], "input_layers": [["input_17", 0, 0]], "output_layers": [["lstm_9", 0, 1], ["lstm_9", 0, 2]]}, "keras_version": "2.3.1", "backend": "tensorflow"}